In [1]:
print("Mi Corazon")

Mi Corazon

In [2]:
a = 5
b = 16
sum = a + b

In [3]:
print(sum)

21

In [12]:
user = int(input("Write a number"))
print(user*user*user)

Write a number5
125

In [1]:
import pandas as pd

In [ ]:
# Series is a one-dimensional labeled array

In [2]:
num = [1,2,3,4,5,6,]
pd.Series(num)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [ ]:
# Series using dictionary

In [3]:
dict = {1: "Eniola", 2: "Timileyin", 3: "Damilola", 4: "Ruth", 5: "Favour"}
pd.Series(dict)

1       Eniola
2    Timileyin
3     Damilola
4         Ruth
5       Favour
dtype: object

In [ ]:
# DataFrame - Two dimensional table, made up of collection of series

In [4]:
data = [
    ["Eniola", "OAU", "400L"], ["Timileyin", "OAUSTEC", "400L"],["Damilola", "EKSU", "400L"], ["Favour", "NAO", "400L"]
]

pd.DataFrame(data)

           0        1     2
0     Eniola      OAU  400L
1  Timileyin  OAUSTEC  400L
2   Damilola     EKSU  400L
3     Favour      NAO  400L

In [5]:
pd.DataFrame(data, columns=["Name", "School", "Level"], index = [1,2,3,4])

        Name   School Level
1     Eniola      OAU  400L
2  Timileyin  OAUSTEC  400L
3   Damilola     EKSU  400L
4     Favour      NAO  400L

In [10]:
# Using dictionaries for DataFrame

dataa = {
    "Company":["Toyota", "Camry", "BMW", "Ferrari"],
    "Model":[2019,2020,2005,2009],
    "Class":["New", "New", "Old", "New"]
}

pd.DataFrame(dataa)

   Company  Model Class
0   Toyota   2019   New
1    Camry   2020   New
2      BMW   2005   Old
3  Ferrari   2009   New

In [8]:
#CSV - Comma Separated Values
import pandas as pd

credits = pd.read_csv("credits.csv")
titles = pd.read_csv("titles.csv")

In [9]:
# Indexing in Pandas
# Means selecting particular rows and columns from a DataFrame
#loc- label based selection
#iloc - index based selection

credits.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [10]:
credits.iloc[0:5,4]

0    ACTOR
1    ACTOR
2    ACTOR
3    ACTOR
4    ACTOR
Name: role, dtype: object

In [14]:
credits["role"]

0           ACTOR
1           ACTOR
2           ACTOR
3           ACTOR
4           ACTOR
           ...
77208       ACTOR
77209       ACTOR
77210       ACTOR
77211       ACTOR
77212    DIRECTOR
Name: role, Length: 77213, dtype: object

In [15]:
#df["column_name"]

In [16]:
credits.role == "ACTOR"

0         True
1         True
2         True
3         True
4         True
         ...
77208     True
77209     True
77210     True
77211     True
77212    False
Name: role, Length: 77213, dtype: bool

In [17]:
credits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77213 entries, 0 to 77212
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  77213 non-null  int64
 1   id         77213 non-null  object
 2   name       77213 non-null  object
 3   character  67586 non-null  object
 4   role       77213 non-null  object
dtypes: int64(1), object(4)
memory usage: 2.9+ MB

In [18]:
credits.describe()

          person_id
count  7.721300e+04
mean   4.994603e+05
std    6.128431e+05
min    7.000000e+00
25%    4.158400e+04
50%    1.829850e+05
75%    8.415570e+05
max    2.371585e+06

In [19]:
credits.describe(include = 'all')

           person_id       id            name character   role
count   7.721300e+04    77213           77213     67586  77213
unique           NaN     5434           53687     47125      2
top              NaN  tm32982  Shah Rukh Khan      Self  ACTOR
freq             NaN      208              30      1667  72690
mean    4.994603e+05      NaN             NaN       NaN    NaN
std     6.128431e+05      NaN             NaN       NaN    NaN
min     7.000000e+00      NaN             NaN       NaN    NaN
25%     4.158400e+04      NaN             NaN       NaN    NaN
50%     1.829850e+05      NaN             NaN       NaN    NaN
75%     8.415570e+05      NaN             NaN       NaN    NaN
max     2.371585e+06      NaN             NaN       NaN    NaN

In [20]:
credits.role.value_counts()

ACTOR       72690
DIRECTOR     4523
Name: role, dtype: int64